Revit 2022 API
AnalyticalModel.SetUsesHardPoints Method
 Sets Hard Points for the Analytical Model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public void SetUsesHardPoints(
	bool hardPoints
)
Visual Basic
Public Sub SetUsesHardPoints ( _
	hardPoints As Boolean _
)
Visual C++
public:
void SetUsesHardPoints(
	bool hardPoints
)
Parameters
hardPoints
Type: System.Boolean
 Enable/disable Hard Points (true = enable).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This AnalyticalModel cannot use Hard Points.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace